const { SlashCommandBuilder, EmbedBuilder, ChannelType } = require('discord.js');
const { voiceCreate } = require('../modules/voiceAutoCreate');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('팀생성')
        .setDescription('<#1123814511946760194> 채널 사용자들 대상으로 랜덤으로 팀 생성'),
    async execute(interaction){
        // --------------------------------------------------------------
        //  # Val
        // --------------------------------------------------------------

        // --------------------------------------------------------------
        //  # Check
        // --------------------------------------------------------------

        // --------------------------------------------------------------
        //  # Init
        // --------------------------------------------------------------
        await interaction.deferReply();

        // --------------------------------------------------------------
        //  # Data
        // --------------------------------------------------------------

        // --------------------------------------------------------------
        //  # Process
        // --------------------------------------------------------------

        // Result
        await interaction.editReply('동우메롱');
        // await interaction.editReply({embeds: [embed]});
    }
}